{
  "intents": [
    {
      "tag": "eye_diseases",
      "patterns": [
        "What are the leading causes of blindness in the US?",
        "What are common eye diseases?",
        "Tell me about eye disorders.",
        "ما هي الأسباب الرئيسية للعمى في الولايات المتحدة؟",
        "ما هي أمراض العيون الشائعة؟",
        "أخبرني عن اضطرابات العين."
      ],
      "responses": [
        "The leading causes of blindness and low vision in the United States are primarily age-related eye diseases.",
        "Leading causes include age-related macular degeneration, cataract, diabetic retinopathy, and glaucoma.",
        "Other common eye disorders include amblyopia and strabismus.",
        "الأسباب الرئيسية للعمى وضعف البصر في الولايات المتحدة هي أمراض العيون المرتبطة بالعمر.",
        "تشمل الأسباب التنكس البقعي المرتبط بالعمر، وإعتام عدسة العين، واعتلال الشبكية السكري، والزرق.",
        "تشمل اضطرابات العيون الأخرى الكسل العيني والحول."
      ]
    },
    {
      "tag": "refractive_errors",
      "patterns": [
        "What are refractive errors?",
        "What types of refractive errors are there?",
        "How can refractive errors be corrected?",
        "What is myopia?",
        "What is hyperopia?",
        "What is astigmatism?",
        "What is presbyopia?",
        "ما هي أخطاء الانكسار؟",
        "ما أنواع أخطاء الانكسار؟",
        "كيف يمكن تصحيح أخطاء الانكسار؟",
        "ما هو قصر النظر؟",
        "ما هو طول النظر؟",
        "ما هو الاستجماتيزم؟",
        "ما هو طول النظر الشيخوخي؟"
      ],
      "responses": [
        "Refractive errors are the most frequent eye problems in the United States.",
        "They include myopia (nearsightedness), hyperopia (farsightedness), astigmatism (distorted vision), and presbyopia (loss of near focusing ability).",
        "Refractive errors can be corrected by eyeglasses, contact lenses, or surgery.",
        "أخطاء الانكسار هي أكثر مشاكل العيون شيوعًا في الولايات المتحدة.",
        "تشمل قصر النظر، وطول النظر، والاستجماتيزم، وطول النظر الشيخوخي.",
        "يمكن تصحيح أخطاء الانكسار باستخدام النظارات الطبية أو العدسات اللاصقة أو الجراحة."
      ]
    },
    {
      "tag": "age_related_macular_degeneration",
      "patterns": [
        "What is age-related macular degeneration?",
        "Tell me about AMD.",
        "How does macular degeneration affect vision?",
        "ما هو التنكس البقعي المرتبط بالعمر؟",
        "أخبرني عن AMD.",
        "كيف يؤثر التنكس البقعي على الرؤية؟"
      ],
      "responses": [
        "Age-related macular degeneration (AMD) is a disease that blurs the sharp, central vision you need for activities like reading and driving.",
        "AMD affects the macula, the part of the eye that allows you to see fine detail.",
        "التنكس البقعي المرتبط بالعمر هو مرض يسبب تشوش الرؤية المركزية الحادة اللازمة للقراءة والقيادة.",
        "يؤثر التنكس البقعي على البقعة، وهي الجزء من العين المسؤول عن رؤية التفاصيل الدقيقة."
      ]
    },
    {
      "tag": "cataract",
      "patterns": [
        "What is a cataract?",
        "Tell me about cataracts.",
        "How are cataracts treated?",
        "ما هو إعتام عدسة العين؟",
        "أخبرني عن الساد.",
        "كيف يتم علاج الساد؟"
      ],
      "responses": [
        "A cataract is a clouding of the eye’s lens, leading to a decrease in vision.",
        "Cataracts can be treated with surgery where the cloudy lens is replaced with a clear artificial lens.",
        "الساد هو تغيم عدسة العين مما يؤدي إلى ضعف في الرؤية.",
        "يمكن علاج الساد من خلال الجراحة التي يتم فيها استبدال العدسة المعتمة بعدسة صناعية شفافة."
      ]
    },
    {
      "tag": "glaucoma",
      "patterns": [
        "What is glaucoma?",
        "Tell me about glaucoma.",
        "How is glaucoma treated?",
        "ما هو الزرق؟",
        "أخبرني عن الجلوكوما.",
        "كيف يتم علاج الزرق؟"
      ],
      "responses": [
        "Glaucoma is a group of eye diseases that can cause vision loss and blindness by damaging the optic nerve.",
        "Early treatment can often prevent serious vision loss.",
        "الجلوكوما هو مجموعة من أمراض العيون التي قد تسبب فقدان البصر بسبب تلف العصب البصري.",
        "يمكن للعلاج المبكر أن يمنع غالبًا فقدان الرؤية الشديد."
      ]
    },
    {
      "tag": "diabetic_retinopathy",
      "patterns": [
        "What is diabetic retinopathy?",
        "Tell me about diabetic eye disease.",
        "How can diabetes affect the eyes?",
        "ما هو اعتلال الشبكية السكري؟",
        "أخبرني عن أمراض العيون المرتبطة بالسكري.",
        "كيف يؤثر السكري على العينين؟"
      ],
      "responses": [
        "Diabetic retinopathy is an eye disease that affects people with diabetes, causing damage to blood vessels in the retina.",
        "It can lead to vision loss if not treated properly.",
        "اعتلال الشبكية السكري هو مرض يصيب العينين لدى مرضى السكري ويتسبب في تلف الأوعية الدموية في الشبكية.",
        "قد يؤدي إلى فقدان البصر إذا لم يتم علاجه بشكل مناسب."
      ]
    },
    {
      "tag": "eye_care_tips",
      "patterns": [
        "How can I protect my vision?",
        "What are tips for healthy eyes?",
        "How do I take care of my eyes?",
        "كيف يمكنني حماية بصري؟",
        "ما هي نصائح العناية بالعين؟",
        "كيف أعتني بعيني؟"
      ],
      "responses": [
        "Wear sunglasses, eat a healthy diet, avoid smoking, and get regular eye exams.",
        "Practice good hygiene with contact lenses and give your eyes regular breaks from screens.",
        "ارتدِ النظارات الشمسية، تناول غذاءً صحياً، تجنب التدخين، واحرص على الفحوصات الدورية للعين.",
        "مارس نظافة جيدة مع العدسات اللاصقة وامنح عينيك فترات راحة منتظمة من الشاشات."
      ]
    },
    {
      "tag": "appointment_booking",
      "patterns": [
        "I want to book an appointment.",
        "Can I schedule an eye check-up?",
        "How can I make an appointment?",
        "أرغب في حجز موعد.",
        "هل يمكنني تحديد موعد لفحص العين؟",
        "كيف يمكنني حجز موعد؟"
      ],
      "responses": [
        "Sure! Please provide your preferred date and time for the appointment.",
        "Of course! When would you like to schedule your eye exam?",
        "بالتأكيد! يرجى تحديد التاريخ والوقت المفضلين لك.",
        "طبعاً! متى تود حجز موعد لفحص العين؟"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Hi", "Hello", "Good morning", "Good evening", "Is anyone there?", "Whats up", "hey", "what's up",
        "مرحباً", "أهلاً", "صباح الخير", "مساء الخير", "هل يوجد أحد هنا؟", "كيف الحال؟"
      ],
      "responses": [
        "Hello!", "Hi there, how can I help?", "Good to see you!",
        "مرحباً بك!", "أهلاً وسهلاً! كيف يمكنني مساعدتك؟", "تشرفت بلقائك!"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye", "See you later", "I am leaving", "bye", "gotta go", "cya", "Have a good day",
        "مع السلامة", "أراك لاحقاً", "وداعاً", "سأذهب الآن", "أحتاج للمغادرة"
      ],
      "responses": [
        "Goodbye!", "Talk to you later!", "Sad to see you go :(",
        "وداعاً!", "أراك لاحقاً!", "من المحزن أن تغادر :("
      ]
    }
  ]
}
